import 'package:flutter/material.dart';
import 'package:readmore/readmore.dart';

class Whowecard extends StatelessWidget {
  const Whowecard({super.key});
  static const String info =
      "موقع سبل هو منصة إلكترونية تهدف إلى تسهيل عمليات التبرع عبر الإنترنت بطريقة آمنة وموثوقة. يسعى الموقع إلى ربط المتبرعين بالمؤسسات الخيرية والمشاريع الإنسانية التي تحتاج إلى دعم مالي لتحقيق أهدافها. تتنوع المشروعات المتاحة على الموقع لتشمل مختلف المجالات مثل الصحة، والتعليم، والإغاثة، والتنمية الاجتماعية، والمساعدات الإنسانية.الميزات الرئيسية لموقع سبلسهولة الاستخدام تصميم الموقع بسيط ومستخدم بشكل يسهل على المتبرعين تصفح المشروعات واختيار الأنسب لدعمهم.الأمان والموثوقية يضمن الموقع أمان المعاملات المالية وسرية بيانات المستخدمين، كما يتم التحقق من المؤسسات الخيرية المدرجة لضمان مصداقيتها.التنوع في المشروعات: يوفر الموقع مجموعة واسعة من المشروعات التي يمكن للمتبرعين المساهمة فيها، مما يتيح لهم اختيار المجال الذي يرغبون في دعمه.التقارير والشفافية: يقدم الموقع تقارير دورية حول تأثير التبرعات وكيفية استخدامها، مما يعزز من شفافية العمليات وثقة المتبرعين.كيفية التبرع عبر موقع سبلالتسجيل: يجب على المستخدمين إنشاء حساب على الموقع أو تسجيل الدخول إذا كان لديهم حساب بالفعل.استكشاف المشروعات: يمكن للمستخدمين استعراض المشروعات المتاحة على المنصة وتحديد المشروع الذي يرغبون في دعمه.اختيار مبلغ التبرع: يمكن للمستخدم تحديد المبلغ الذي يرغب في التبرع به.إتمام عملية الدفع: يتم إتمام عملية التبرع من خلال وسائل الدفع الإلكترونية المتاحة على الموقع.الفوائد للمؤسسات الخيريةزيادة الوصول: تمكن المؤسسات من الوصول إلى شريحة أوسع من المتبرعين من خلال الإنترنت.تحسين الكفاءة: يساعد الموقع في تقليل التكاليف التشغيلية المرتبطة بجمع التبرعات التقليدية.التقارير التفصيلية توفر المنصة تقارير مفصلة حول التبرعات والمساهمات، مما يساعد المؤسسات في إدارة مواردها بشكل أفضل.موقع سبل يعد حلاً مثالياً للأفراد والمؤسسات الذين يسعون لدعم القضايا الخيرية بشكل سهل وآمن وشفاف، مما يساهم في تعزيز العمل الخيري والتنموي في المجتمع.";

  @override
  Widget build(BuildContext context) {
    final double width = MediaQuery.of(context).size.width;
    return  Card(
      shape: const RoundedRectangleBorder(
        borderRadius: BorderRadius.all(
          Radius.circular(30),
        ),
      ),
      elevation: 8,
      borderOnForeground: true,
      shadowColor: const Color.fromRGBO(145, 104, 58, 1),
      surfaceTintColor: const Color.fromRGBO(145, 104, 58, 1),
      margin: const EdgeInsets.all(10),
      child: Padding(
        padding: const EdgeInsets.all(15),
        child: ReadMoreText(
          info,
          style: TextStyle(
            color: Colors.black, //Color.fromRGBO(214, 171, 127, 1),
            fontWeight: FontWeight.bold,
            fontSize: width / 19,
          ),
          moreStyle: const TextStyle(color: Color.fromRGBO(145, 104, 58, 1)),
          textDirection: TextDirection.rtl,
          lessStyle: const TextStyle(color: Color.fromRGBO(145, 104, 58, 1)),
        ),
      ),
    );
  }
}
